Cats99/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("name", "birth_date", "color", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Donald"], ["birth_date", "2022-04-01"], ["color", "orange"], ["sex", "M"], ["created_at", "2022-04-01 23:55:29.622241"], ["updated_at", "2022-04-01 23:55:29.622241"]]